EDT/УТ/src/Documents/мгТарифыРасчетаНачисленийЗаОсновнуюРаботу/мгТарифыРасчетаНачисленийЗаОсновнуюРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгТарифыРасчетаНачисленийЗаОсновнуюРаботу</name>
  <comment>(Миго-групп)</comment>
  <registerRecords>InformationRegister.мгТарифыПоКонтрагентам</registerRecords>
  <registerRecords>InformationRegister.мгТарифыОсновныхНачислений</registerRecords>
  <registerRecords>InformationRegister.мгТарифыПодъем</registerRecords>
  <registerRecords>InformationRegister.мгТарифыФрахт</registerRecords>
  <attributes>
    <name>Регион</name>
    <comment>Регион</comment>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеТарифа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТарифовДоставкаЗабор</name>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияЗаказа</name>
      <type>
        <types>CatalogRef.мгКатегорииЗаказов</types>
        <types>CatalogRef.мгКатегорииЗабора</types>
      </type>
    </attributes>
    <attributes>
      <name>Территориальность</name>
      <type>
        <types>CatalogRef.мгЛокализацииЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаемныйЭкипаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СобственныйЭкипажБезЭкспедитора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СобственныйЭкипажСЭкспедиторомВодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СобственныйЭкипажСЭкспедиторомЭкспедитор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПешийКурьер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидТарифа</name>
      <type>
        <types>EnumRef.ТипыТарифовРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокТарифовФрахт</name>
    <attributes>
      <name>Условие</name>
      <type>
        <types>EnumRef.мгУсловияФрахт</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокТарифовЗаПодьемы</name>
    <attributes>
      <name>ВесоваяКатегория</name>
      <type>
        <types>CatalogRef.мгВесовыеКатегорииПодъема</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПодъема</name>
      <type>
        <types>EnumRef.ВидыПодъемовВодителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокТарифовПоКонтрагентам</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/мгТарифыОсновныхНачислений/мгТарифыОсновныхНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгТарифыОсновныхНачислений</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Регион</name>
    <comment>Регион</comment>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияЗаказа</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
      <types>CatalogRef.мгКатегорииЗабора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Территориальность</name>
    <type>
      <types>CatalogRef.мгЛокализацииЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидТарифа</name>
    <type>
      <types>EnumRef.ТипыТарифовРасчетаЗарплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/мгТарифыФрахт/мгТарифыФрахт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгТарифыФрахт</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Условие</name>
    <type>
      <types>EnumRef.мгУсловияФрахт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/мгТарифыПоКонтрагентам/мгТарифыПоКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгТарифыПоКонтрагентам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/мгТарифыРасчетаНачисленийЗаОсновнуюРаботу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгТарифыОсновныхНачислений
	Движения.мгТарифыОсновныхНачислений.Записывать = Истина;
	Движения.мгТарифыОсновныхНачислений.Очистить();
	Для Каждого ТекСтрокаСписокТарифовДоставкаЗабор Из СписокТарифовДоставкаЗабор Цикл
		Движение = Движения.мгТарифыОсновныхНачислений.Добавить();
		Движение.Период = Дата;
		Движение.Регион = Регион;
		Движение.ТипЗаказа = ТекСтрокаСписокТарифовДоставкаЗабор.ТипЗаказа;
		Движение.КатегорияЗаказа = ТекСтрокаСписокТарифовДоставкаЗабор.КатегорияЗаказа;
		Движение.Территориальность = ТекСтрокаСписокТарифовДоставкаЗабор.Территориальность;
		Движение.ВидТарифа = ТекСтрокаСписокТарифовДоставкаЗабор.ВидТарифа;
		Движение.Значение = ТекСтрокаСписокТарифовДоставкаЗабор.Значение;
	КонецЦикла;

	// регистр мгТарифыФрахт
	Движения.мгТарифыФрахт.Записывать = Истина;
	Движения.мгТарифыФрахт.Очистить();
	Для Каждого ТекСтрокаСписокТарифовФрахт Из СписокТарифовФрахт Цикл
		Движение = Движения.мгТарифыФрахт.Добавить();
		Движение.Период = Дата;
		Движение.Условие = ТекСтрокаСписокТарифовФрахт.Условие;
		Движение.Значение = ТекСтрокаСписокТарифовФрахт.Значение;
	КонецЦикла;

	//// регистр мгТарифыПодъем
	//Движения.мгТарифыПодъем.Записывать = Истина;
	//Движения.мгТарифыПодъем.Очистить();
	//Для Каждого ТекСтрокаСписокТарифовЗаПодьемы Из СписокТарифовЗаПодьемы Цикл
	//	Движение = Движения.мгТарифыПодъем.Добавить();
	//	Движение.Период = Дата;
	//	Движение.ВесоваяКатегория = ТекСтрокаСписокТарифовЗаПодьемы.ВесоваяКатегория;
	//	Движение.ВидПодъема = ТекСтрокаСписокТарифовЗаПодьемы.ВидПодъема;
	//	Движение.Тариф = ТекСтрокаСписокТарифовЗаПодьемы.Тариф;
	//КонецЦикла;

	// регистр мгТарифыПоКонтрагентам
	Движения.мгТарифыПоКонтрагентам.Записывать = Истина;
	Движения.мгТарифыПоКонтрагентам.Очистить();
	Для каждого ТекСтрокаСписокТарифовПоКонтрагентам Из СписокТарифовПоКонтрагентам Цикл
		Движение = Движения.мгТарифыПоКонтрагентам.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаСписокТарифовПоКонтрагентам.Магазин;
		Движение.Тариф = ТекСтрокаСписокТарифовПоКонтрагентам.Тариф;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
